src/InformationRegisters/КвотыАссортимента/КвотыАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КвотыАссортимента</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Квота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтклонения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КоллекцияНоменклатуры</name>
    <type>
      <types>CatalogRef.КоллекцииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Ассортимент/Ассортимент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ассортимент</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РольАссортимента</name>
    <type>
      <types>EnumRef.РолиАссортимента</types>
    </type>
  </resources>
  <resources>
    <name>РазрешеныЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешеныПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </resources>
  <resources>
    <name>КоллекцияНоменклатуры</name>
    <type>
      <types>CatalogRef.КоллекцииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>РейтингПродаж</name>
    <type>
      <types>CatalogRef.РейтингиПродажНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияИзмененияФорматовМагазинов/ИсторияИзмененияФорматовМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененияФорматовМагазинов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтадииАссортимента/СтадииАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтадииАссортимента</name>
  <enumValues>
    <name>РазрешеныТолькоЗакупки</name>
  </enumValues>
  <enumValues>
    <name>РазрешеныЗакупкиИПродажи</name>
  </enumValues>
  <enumValues>
    <name>РазрешеныТолькоПродажи</name>
  </enumValues>
  <enumValues>
    <name>ЗапрещеныЗакупкиИПродажи</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИзменениеАссортимента/ИзменениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеАссортимента</name>
  <registerRecords>InformationRegister.Ассортимент</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииИзмененияАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>EnumRef.СтадииАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыИзмененияАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>КоллекцияНоменклатуры</name>
    <type>
      <types>CatalogRef.КоллекцииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЗакупок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаЗакупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПродаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаПродажи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>РольАссортимента</name>
      <type>
        <types>EnumRef.РолиАссортимента</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>РейтингПродаж</name>
      <type>
        <types>CatalogRef.РейтингиПродажНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ВариантыКомплектацииНоменклатуры/ВариантыКомплектацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыКомплектацииНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураОсновногоКомпонента</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаОсновногоКомпонента</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСборкиРазборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаЦеныНабора</name>
    <type>
      <types>EnumRef.ВариантыРасчетаЦенНаборов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПредставленияНабораВПечатныхФормах</name>
    <type>
      <types>EnumRef.ВариантыПредставленияНаборовВПечатныхФормах</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/АссортиментСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль "Ассортимент", содержит процедуры и функции для
// проверки корректности документов изменения ассортимента и установки квот ассортимента,
// обработки регистрации ассортимента в регистрах,
// обработки введенных пользователем данных,
// а также содержит ряд вспомогательных функций и процедур
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПроцедурыИФункцииПроверкиКорректностиЗаполненияДокументов

// Функция проверяет, соответствует ли реквизит "ЦенаВключаетНДС"
// у всех видов цен в табличной части "Товары" документа "ИзменениеАссортимента"
// и у вида цен, указанного в объекте планирования этого документа.
// В случае нахождения расхождений выводит информационное сообщение
// Вызывается ПЕРЕД записью соответствующего документа-объекта.
// Параметры: 
// 		ДокументОбъект - ДокументОбъект.ИзменениеАссортимента
// Возвращаемое значение: 
// 		ВсеВерно - Булево - если реквизит "ЦенаВключаетНДС" все виды цен совпадает, возвращается Истина, иначе Ложь
Функция ВидыЦенИзмененияАссортиментаСоответствуютПравилам(ДокументОбъект) Экспорт
	ВсеВерно=Истина;
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.НомерСтроки,
	               |	ТаблицаТовары.ВидЦены
				   |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	&ТаблицаТовары КАК ТаблицаТовары
				   |;
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.НомерСтроки,
	               |	ТаблицаТовары.ВидЦены,
	               |	ТаблицаТовары.ВидЦены.Наименование КАК ВидЦенНаименование
	               |ИЗ
	               |	ТаблицаТовары КАК ТаблицаТовары
	               |ГДЕ
	               |	ТаблицаТовары.ВидЦены.ЦенаВключаетНДС <> &ЦенаВключаетНДС
	               |	ИЛИ (НЕ ТаблицаТовары.ВидЦены.ИспользоватьПриПродаже)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаТовары", ДокументОбъект.Товары.Выгрузить());
	РеквизитыОбъекта = Новый Структура;
	РеквизитыОбъекта.Вставить("ЦенаВключаетНДС", "РозничныйВидЦены.ЦенаВключаетНДС");
	ДанныеВидаЦен = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.ОбъектПланирования, РеквизитыОбъекта);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС", ДанныеВидаЦен.ЦенаВключаетНДС);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВсеВерно = Ложь;
		ТекстСообщения = НСтр("ru='В строке %1 выбран некорректный вид цен %2';uk='У рядку %1 вибраний некоректний вид цін %2'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
																				 Выборка.НомерСтроки,
																				 Выборка.ВидЦенНаименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ДокументОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки, "ВидЦены"),
			"Объект",
			Истина);
	КонецЦикла;
	
	Возврат ВсеВерно;	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРегистрацииАссортиментаМагазиновВРегистрах

// Процедура формирует движения по РС "Квоты ассортимента"
// Параметры: 
// 		ДополнительныеСвойства - Структура
// 		Движения - Коллекция движений
// 		Отказ - Булево
Процедура ОтразитьКвотыАссортимента(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКвотыАссортимента;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияКвотыАссортимента            = Движения.КвотыАссортимента;
	ДвиженияКвотыАссортимента.Записывать = Истина;
	
	ДвиженияКвотыАссортимента.Загрузить(Таблица);
	
КонецПроцедуры // ОтразитьЦеныНоменклатуры()

// Процедура формирует движения по РС "Ассортимент магазинов"
// Параметры: 
// 		ДополнительныеСвойства - Структура
//   	Движения - Коллекция движений
//   	Отказ - Булево
Процедура ОтразитьАссортимент(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАссортимент;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияАссортимент = Движения.Ассортимент;
	ДвиженияАссортимент.Записывать = Истина;
	//
	ДвиженияАссортимент.Загрузить(Таблица);
	
КонецПроцедуры // ОтразитьЦеныНоменклатуры()

#КонецОбласти

// Функция возвращает значение текущего объекта планирования ассортимента в зависимости от настроек
//
// Параметры:
//  ОбъектПроверки  - СправочникСсылка.Склады, СправочникСсылка.ФорматыМагазинов - Склад или формат для которого определяется объект планирования
//  НаДату  - Дата - Дата на которую определяется текущий объект планирования
//
// Возвращаемое значение:
//   СправочникСсылка.ФорматыМагазинов, СправочникСсылка.Склады   - текущий объект планирования, в зависимости от ФО - формат магазина или склад-магазин
//
Функция ОбъектПланирования(ОбъектПроверки, НаДату = Неопределено) Экспорт 
	
	Если ТипЗнч(ОбъектПроверки) = Тип("СправочникСсылка.Склады") И ПолучитьФункциональнуюОпцию("ИспользоватьФорматыМагазинов") Тогда
		
		ОбъектПланирования = РегистрыСведений.ИсторияИзмененияФорматовМагазинов.ТекущийФормат(ОбъектПроверки, НаДату);
	Иначе
		
		ОбъектПланирования = ОбъектПроверки;
		
	КонецЕсли;
	
	Возврат ОбъектПланирования;

КонецФункции
 
#Область ПрочиеПроцедурыИФункции

// Процедура проверяет стадию документа "ИзменениеАссортимента"
// Вызывается при обработке заполнения документа "Установка цен" на основании "ИзменениеАссортимента"
// если документ переводит товары в стадию "ЗапрещеныЗакупкиИПродажи"
// то принудительно вызывается исключение и формируется соответствующий текст ошибки
// 
// Параметры: 
// 		ДокументОснование - ДокументСсылка.ИзменениеАссортимента
Процедура ПроверитьНеобходимостьУстановкиЦенНаОсновании(ДокументОснование) Экспорт
	Если ДокументОснование.Стадия=Перечисления.СтадииАссортимента.ЗапрещеныЗакупкиИПродажи Тогда
			
			ТекстОшибки = НСтр("ru='Документ %1 запрещает и закукпи, и продажи.%2Установка цен на основании такого документа невозможна.';uk='Документ %1 забороняє і купівлі, і продажі.%2Встановлення цін на підставі такого документа неможливе.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДокументОснование, Символы.ПС);
			
			ВызватьИсключение ТекстОшибки;
			
	КонецЕсли;
КонецПроцедуры

// Функция получает таблицы товаров и видов цен, содержащихся в табличной части документа "ИзменениеАссортимента"
// вызывается при вводе на основании изменения ассортимента документа установки цен
// Параметры: 
// 		ДокументОснование - ДокументСсылка.ИзменениеАссортимента
// Возвращаемое значение: 
// 		РезультатПакета - Массив - результат выполнения пакета запросов
Функция РезультатПакетаВидыЦенИТоварыДляУстановкиПоАссортименту(ДокументОснование) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИзменениеАссортиментаТовары.Номенклатура КАК Номенклатура,
	|	ИзменениеАссортиментаТовары.ВидЦены КАК ВидЦены
	|ИЗ
	|	Документ.ИзменениеАссортимента.Товары КАК ИзменениеАссортиментаТовары
	|ГДЕ
	|	ИзменениеАссортиментаТовары.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИзменениеАссортиментаТовары.ВидЦены КАК ВидЦены
	|ИЗ
	|	Документ.ИзменениеАссортимента.Товары КАК ИзменениеАссортиментаТовары
	|ГДЕ
	|	ИзменениеАссортиментаТовары.Ссылка = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	
	РезультатПакета=Запрос.ВыполнитьПакет();
	
	Возврат РезультатПакета;
	
КонецФункции

// Функция возвращает признак контроля ассортимента по истории изменений
//
// Параметры:
//  Склад  - СправочникСсылка.Склады - Склад/магазин для которого проверяется контроль ассортимента
//  НаДату  - Дата - Дата на которую производится проверка контроля ассортимента
//
// Возвращаемое значение:
//   Булево   - Истина, если ассортимент контроллируется на складе и Ложь, если нет.
//
Функция КонтролироватьАссортимент(Знач Склад, Знач НаДату = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НаДату = Неопределено Тогда
	
		НаДату = ТекущаяДатаСеанса();
	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияИзмененияФорматовМагазиновСрезПоследних.КонтролироватьАссортимент
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияФорматовМагазинов.СрезПоследних(&НаДату, Склад = &Склад) КАК ИсторияИзмененияФорматовМагазиновСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Склад", Склад);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.КонтролироватьАссортимент;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции 
 
// Процедура проверяет вхождение в ассортимент магазина на указанную дату товаров в подборе, не входящих в основание
// Параметры: 
//		Объект - данные формы структура - объект подбора
// 		ИмяРеквизитаСклад - строка, указывает на реквизит склад, ассортимент которого проверяется
//		ТаблицаТоваров - таблица товаров, добавленных в табличную часть документа, для которых нужно выполнить проверку
//
Процедура ПроверитьАссортиментТаблицыПодобранныхТоваров(Объект, ИмяРеквизитаСклад, ТаблицаТоваров = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Магазин = Объект[ИмяРеквизитаСклад];
	Дата = ?(ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления), Объект.ЖелаемаяДатаПоступления, Объект.Дата);
	Дата = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	КонтролироватьАссортимент = АссортиментСерверПовтИсп.КонтролироватьАссортимент(Магазин, Дата);
	
	Если КонтролироватьАссортимент Тогда
		Запрос = Новый Запрос;
		Если ТипЗнч(ТаблицаТоваров) = Тип("ТаблицаЗначений") Тогда
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|ВЫБРАТЬ
			|	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ТоварыДокумента
			|ИЗ
			|	&ТоварыДокумента КАК ТоварыДокумента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура,
			|	ТоварыДокумента.Номенклатура.Наименование КАК НоменклатураНаименование
			|ИЗ
			|	ТоварыДокумента КАК ТоварыДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Товары КАК Товары
			|		ПО ТоварыДокумента.Номенклатура = Товары.Номенклатура
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ассортимент.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), ОбъектПланирования = &ОбъектПланирования) КАК Ассортимент
			|		ПО ТоварыДокумента.Номенклатура = Ассортимент.Номенклатура
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ассортимент.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), ОбъектПланирования = &ОбъектПланирования И Номенклатура В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Ссылка.Владелец КАК Номенклатура ИЗ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Т Внутреннее Соединение ТоварыДокумента КАК ТД ПО Т.Номенклатура = ТД.Номенклатура)) КАК АссортиментНаборы
			|		ПО ТоварыДокумента.Номенклатура = АссортиментНаборы.Номенклатура
			|ГДЕ
			|	ЕСТЬNULL(АссортиментНаборы.РазрешеныЗакупки, ЛОЖЬ) = ЛОЖЬ И ЕСТЬNULL(Ассортимент.РазрешеныЗакупки, ЛОЖЬ) = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			Запрос.УстановитьПараметр("Товары", ТаблицаТоваров);
		Иначе
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ТоварыДокумента
			|ИЗ
			|	&ТоварыДокумента КАК ТоварыДокумента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура,
			|	ТоварыДокумента.Номенклатура.Наименование КАК НоменклатураНаименование
			|ИЗ
			|	ТоварыДокумента КАК ТоварыДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ассортимент.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), ОбъектПланирования = &ОбъектПланирования) КАК Ассортимент
			|		ПО ТоварыДокумента.Номенклатура = Ассортимент.Номенклатура
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ассортимент.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), ОбъектПланирования = &ОбъектПланирования И Номенклатура В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Ссылка.Владелец КАК Номенклатура ИЗ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Т Внутреннее Соединение ТоварыДокумента КАК ТД ПО Т.Номенклатура = ТД.Номенклатура)) КАК АссортиментНаборы
			|		ПО ТоварыДокумента.Номенклатура = АссортиментНаборы.Номенклатура
			|			И АссортиментНаборы.РазрешеныЗакупки
			|ГДЕ
			|	ЕСТЬNULL(АссортиментНаборы.РазрешеныЗакупки, ЛОЖЬ) = ЛОЖЬ И ЕСТЬNULL(Ассортимент.РазрешеныЗакупки, ЛОЖЬ) = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ТоварыДокумента", Объект.Товары.Выгрузить());
		
		
		Запрос.УстановитьПараметр("Период", Дата);
		ОбъектПланирования = АссортиментСервер.ОбъектПланирования(Магазин, Дата);
		Запрос.УстановитьПараметр("ОбъектПланирования", ОбъектПланирования);
		
		Результат=Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = НСтр("ru='Товар %1 не включен в ассортимент или запрещен к закупке.';uk='Товар %1 не включений в асортимент або заборонений до купівлі.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.НоменклатураНаименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				Объект.Ссылка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки, "Номенклатура"),
				"Объект",
				Ложь);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Возвращае массив видов цен, которые назначены для объекта планирования на дату
//
// Параметры:
//  ОбъектПланирования - СправочникСсылка.Склады, СправочникСсылка.ФорматыМагазинов 
//  Дата			 - Дата 
//  ОтборПоРесурсам	 - Структура 
// 
// Возвращаемое значение:
//  Массив 
//
Функция ВидыЦенПоАссортименту(ОбъектПланирования, Дата, ОтборПоРесурсам = Неопределено) Экспорт
	
	ОбъектПланирования = ОбъектПланирования(ОбъектПланирования, Дата);
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ассортимент.ВидЦены КАК ВидЦены
	|ИЗ
	|	РегистрСведений.Ассортимент.СрезПоследних(&Дата, ОбъектПланирования = &ОбъектПланирования) КАК Ассортимент
	|ГДЕ
	|	ИСТИНА
	|	И &ОтборПоРесурсам";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ОбъектПланирования", ОбъектПланирования);
	
	
	Если ОтборПоРесурсам <> Неопределено Тогда
		ОтборПоРесурсамСтрока = "ИСТИНА";
	Иначе
		ОтборПоРесурсамСтрока = "";
		Для Каждого КлючЗначение Из ОтборПоРесурсам Цикл
			ОтборПоРесурсамСтрока = ОтборПоРесурсамСтрока + "
			|	 Ассортимент." + КлючЗначение.Ключ + " = &" +  КлючЗначение.Ключ;
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОтборПоРесурсам", ОтборПоРесурсамСтрока);
	
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЦены");
	
КонецФункции

// Функция получает значение цены продажи
// в соответствии с видом цен, указанным в регистре "Ассортимент",
// для номенклатуры и склада на указанную дату
//
// Параметры: 
//		ПараметрыОтбора - Структура - Параметры отбора для цены
//
Функция ПолучитьЦенуПоАссортименту(ПараметрыОтбора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	ОбъектПланирования = АссортиментСервер.ОбъектПланирования(ПараметрыОтбора.Склад, ПараметрыОтбора.Дата);
	СтруктураАссортимента = СтруктураСостоянияАссортиментаТовараВФормате(ПараметрыОтбора.Номенклатура, ОбъектПланирования, ПараметрыОтбора.Дата);
	
	ВидЦены = СтруктураАссортимента.ВидЦены;
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	Для Каждого Параметр Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Запрос.Текст =
	"
	|ВЫБРАТЬ
	|	ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки1, 1)
	|	* ЕстьNULL(ЦеныНоменклатурыСрезПоследних.Цена,0)
	|	* ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	|					ТОГДА 
	|						(КурсыВалютыЦены.Курс * КурсыВалюты.Кратность)
	|						/ (КурсыВалюты.Курс * КурсыВалютыЦены.Кратность)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ /ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки2,1) КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), 
	|				ВидЦены = ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен)
	|				И Номенклатура = ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура)
	|				И Характеристика = ВЫРАЗИТЬ(&Характеристика КАК Справочник.ХарактеристикиНоменклатуры)
	|) КАК ЦеныНоменклатурыСрезПоследних
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютыЦены
	|ПО 
	|	ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалюты
	|	По Истина
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВЫРАЗИТЬ(&Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
		"ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура)"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЦеныНоменклатурыСрезПоследних.Упаковка",
		"ЦеныНоменклатурыСрезПоследних.Номенклатура"));	
	
	Цена = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Цена = Выборка.Цена;
	КонецЕсли;
	Возврат Цена;
	
КонецФункции

// Функция получает актуальные значения ресурсов регистра сведений "Ассортимент" на указанную дату 
// для товара и формата магазина
// Параметры: 
// 		Номенклатура - СправчоникСсылка.Номенклатура
// 		ОбъектПроверки - СправчоникСсылка.ФорматыМагазинов ИЛИ СправочникСсылка.Магазины
// 		НаДату - Дата (дата и время)
// Возвращаемое значение: 
// 		СтруктураСостоянияАссортимента - Структура - аналогична выборке всех ресурсов из регистра
Функция СтруктураСостоянияАссортиментаТовараВФормате(Номенклатура, ОбъектПроверки, НаДату) Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ассортимент.РольАссортимента КАК РольАссортимента,
	|	Ассортимент.РазрешеныЗакупки КАК РазрешеныЗакупки,
	|	Ассортимент.РазрешеныПродажи КАК РазрешеныПродажи,
	|	Ассортимент.РейтингПродаж КАК РейтингПродаж,
	|	Ассортимент.ВидЦены КАК ВидЦены
	|ИЗ
	|	РегистрСведений.Ассортимент.СрезПоследних(
	|			КОНЕЦПЕРИОДА(&НаДату, ДЕНЬ),
	|			ОбъектПланирования = &ОбъектПланирования
	|				И (Номенклатура = &Номенклатура ИЛИ Номенклатура В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Ссылка.Владелец КАК Номенклатура Из Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Т Где Т.Номенклатура = &Номенклатура))) КАК Ассортимент
	|");
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	ОбъектПланирования = АссортиментСервер.ОбъектПланирования(ОбъектПроверки, НаДату);
	Запрос.УстановитьПараметр("ОбъектПланирования", ОбъектПланирования);
	
	Запрос.УстановитьПараметр("НаДату",НаДату);
	РезультатПакета=Запрос.ВыполнитьПакет();
	ИндексПоследнего=РезультатПакета.Количество()-1;
	РезультатЗапроса=РезультатПакета[ИндексПоследнего];
	
	СтруктураСостоянияАссортимента=Новый Структура;
	СтруктураСостоянияАссортимента.Вставить("РольАссортимента", Перечисления.РолиАссортимента.ПустаяСсылка());
	СтруктураСостоянияАссортимента.Вставить("РазрешеныЗакупки", Ложь);
	СтруктураСостоянияАссортимента.Вставить("РазрешеныПродажи", Ложь);
	СтруктураСостоянияАссортимента.Вставить("ВидЦены",          Справочники.ВидыЦен.ПустаяСсылка());
	СтруктураСостоянияАссортимента.Вставить("РейтингПродаж",    Справочники.РейтингиПродажНоменклатуры.ПустаяСсылка());
	
	Выборка=РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураСостоянияАссортимента, Выборка);
	КонецЕсли;
	
	Возврат СтруктураСостоянияАссортимента;
	
КонецФункции

// Функция получает актуальные значения ресурсов регистра сведений "Квоты ассортимента" на указанную дату 
// для категории, марки и формата магазина
// Параметры: 
// 		ОбъектПланирования - СправчоникСсылка.ФорматыМагазинов, СправчоникСсылка.Склады - Объект по которому получаем квоты
// 		ТоварнаяКатегория - СправчоникСсылка.ТоварныеКатегории
// 		Марка - СправчоникСсылка.Марки
// 		НаДату - Дата (дата и время)
// Возвращаемое значение: 
// 		СтруктураКвоты - Структура - аналогична выборке всех ресурсов из регистра
Функция СтруктураКвотыПоКатегории(ОбъектПланирования, ТоварнаяКатегория, Марка, НаДату) Экспорт
	СтруктураКвоты=Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(К.Период) КАК Период
	|ПОМЕСТИТЬ ТекущиеКвоты
	|ИЗ
	|	РегистрСведений.КвотыАссортимента КАК К
	|ГДЕ
	|	К.Период <= &НаДату
	|	И К.ОбъектПланирования = &ОбъектПланирования
	|	И К.ТоварнаяКатегория = &ТоварнаяКатегория
	|	И К.Марка = &Марка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Квоты.Квота КАК Квота,
	|	Квоты.ПроцентОтклонения КАК ПроцентОтклонения
	|ИЗ
	|	РегистрСведений.КвотыАссортимента КАК Квоты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеКвоты КАК ТекущиеКвоты
	|		ПО Квоты.Период = ТекущиеКвоты.Период
	|ГДЕ
	|	Квоты.ОбъектПланирования = &ОбъектПланирования
	|	И Квоты.ТоварнаяКатегория = &ТоварнаяКатегория
	|	И Квоты.Марка = &Марка";
	
	Запрос.УстановитьПараметр("ТоварнаяКатегория",ТоварнаяКатегория);
	Запрос.УстановитьПараметр("ОбъектПланирования",ОбъектПланирования);
	Запрос.УстановитьПараметр("Марка",Марка);
	Запрос.УстановитьПараметр("НаДату",НаДату);
	
	РезультатЗапроса=Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураКвоты.Вставить("Квота", 0);
		СтруктураКвоты.Вставить("ПроцентОтклонения", 0);
	Иначе
		Выборка=РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СтруктураКвоты.Вставить("Квота", Выборка.Квота);
		СтруктураКвоты.Вставить("ПроцентОтклонения", Выборка.ПроцентОтклонения);
	КонецЕсли;
	Возврат СтруктураКвоты;
КонецФункции

//Если в настройках СКД включено использование отбора по ассортименту,
//то процедура устанавливает служебный параметр использования отбора по ассортименту
//
//	Параметры:
//		КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек СКД
//		
Процедура ВключитьОтборПоАссортиментуВСКД(КомпоновщикНастроек) Экспорт
	
	ПараметрИспользуетсяОтборПоАссортименту  = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(
		КомпоновщикНастроек.Настройки, 
		"ИспользуетсяОтборПоАссортименту");
	
	Если ПараметрИспользуетсяОтборПоАссортименту = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрИспользуетсяОтборПоАссортименту.Значение      = Ложь;
	ПараметрИспользуетсяОтборПоАссортименту.Использование = Ложь;
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
	
		НастройкиОсновнойСхемы = КомпоновщикНастроек.Настройки;
	
	Иначе
	
		НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	КонецЕсли;
	
	ИспользуетсяОтборПоАссортименту = Ложь;
	
	ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НастройкиОсновнойСхемы.Отбор,"ОбъектПланирования");
	Для каждого ЭлементОтбора из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Использование Тогда  
			ИспользуетсяОтборПоАссортименту = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НастройкиОсновнойСхемы.Отбор,"КоллекцияНоменклатуры");
	Для каждого ЭлементОтбора из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Использование Тогда  
			ИспользуетсяОтборПоАссортименту = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
	
		ФиксированныеНастройки = КомпоновщикНастроек.Настройки;
	
	Иначе
	
		ФиксированныеНастройки = КомпоновщикНастроек.ФиксированныеНастройки;
	
	КонецЕсли;
	
	ПараметрИспользуетсяОтборПоАссортименту = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(
		ФиксированныеНастройки, 
		"ИспользуетсяОтборПоАссортименту");
	
	ПараметрИспользуетсяОтборПоАссортименту.Значение = Истина;
	ПараметрИспользуетсяОтборПоАссортименту.Использование = ИспользуетсяОтборПоАссортименту;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
